{
    "name" : "japchae",
    "altName" : "잡채",
    "prepTime" : 40,
    "description" : "Dangmyeon (sweet potato noodles) stir-fried with vegetables.",
    "intro" : "The bright, colourful Korean noodle dish made with an abundance of vegetables, juicy bits of marinated pork and a sesame-forward dressing. Made with sweet potato noodles which have a unique slippery, chewy texture, this is sort of a stir fry, sort of a noodle salad.",
    "ingredients" : [
        {"name": "garlic", "amt": 2, "unit": "cloves"},
        {"name": "sugar", "amt": 1, "unit": "tablespoons"},
        {"name": "soy-sauce", "amt": 2, "unit": "tablespoons"},
        {"name": "sesame-oil", "amt": 2, "unit": "tablespoons"},
        {"name" : "dangmyeon", "amt" : 4, "unit" : "ounces"},
        {"name" : "pork-belly", "amt" : 4, "unit" : "ounces"},
        {"name": "pepper", "amt": 1, "unit": "pinches"},
        {"name": "salt", "amt": 1, "unit": "teaspoons"},
        {"name": "onion", "amt": 1, "unit": "cups"},
        {"name": "scallion", "amt": 3, "unit": "stalks"},
        {"name": "shiitake-mushroom", "amt": 2, "unit": "units"}
    ],
    "steps" : [
        "Soak shiitake mushrooms in warm water for 2-3 hours, then slice into thin strips.",
        "Slice pork belly into thin strips.",
        "Marinate pork strips and shiitake mushrooms in garlic, sugar, a pinch of pepper, soy sauce, and sesame oil. Set in fridge for at least 30 minutes.",
        "Bring a large pot of water to a boil. Put the noodles into the boiling water, cover and cook for 1 minute. Stir them with a wooden spoon so they don’t stick together. Cover and keep cooking for another 7 minutes until the noodles are soft and chewy.",
        "Strain and cut them a few times with kitchen scissors. Put the noodles into a large bowl. Add 2 teaspoons toasted sesame oil, 1 teaspoon soy sauce, and 1 teaspoon sugar. Mix well by hand or a wooden spoon.",
        "Heat up a skillet over medium high heat. Add 2 teaspoons vegetable oil with the onion, scallion, and a pinch of salt. Stir-fry about 2 minutes until the onion looks a little translucent. Transfer to the noodle bowl.",
        "Stir-fry vegetables of choice.",
        "Add all cooked ingredients to a mixing bowl. Add garlic, soy sauce, sugar, pepper, and sesame oil. Mix by hand.",
        "Transfer to a large plate and serve warm or cold."
    ]
}