{
    "name" : "jjajang-tteokbokki",
    "altName" : "짜장떡볶이",
    "prepTime" : 30,
    "description" : "Chewy rice cakes cooked in black bean paste sauce.",
    "intro" : "Jjajang tteokbokki is a love child between jjajangmyeon and tteokbokki that has the best of both worlds. Squishy rice cakes with sweet, salty, and velvety black bean sauce were meant to be together. If you love tteokbokki, then you will love this non-spicy version.",
    "ingredients": [
        {"name": "chunjang", "amt": 0.25, "unit": "cups"},
        { "name": "rice-cake", "amt": 0.5, "unit": "pounds" },
        { "name": "scallion", "amt": 2, "unit": "stalks" },
        {"name": "garlic", "amt": 4, "unit": "cloves"},
        { "name": "soy-sauce", "amt": 2, "unit": "tablespoons" },
        { "name": "water", "amt": 500, "unit": "milliliters" },
        { "name": "gochugaru", "amt": 1, "unit": "teaspoons" },
        { "name": "sugar", "amt": 2, "unit": "tablespoons" }
        ],
      "steps": [
        "In a medium-sized pan, add oil, garlic, and scallions and heat on medium until the garlic has turned golden brown.",
        "Sieve the aromatics and reserve the oil.",
        "Pour oil into a nonstick pan. Add the black bean paste and heat it on medium heat until the paste starts to bubble. Drop the heat to a medium-low.",
        "Using a rubber or coated spatula (not wooden; wooden spatulas will stain), break apart the black bean paste and swirl around so that the oil can penetrate through.",
        "After 5 minutes, you’ll see the black bean paste slowly separate. Strain the toasted black bean paste in a sieve.",
        "In a large pan, heat on high. When smoke starts to rise from the pan, turn the heat off and add the soy sauce.",
        "Let the soy sauce caramelize and slightly burn. Deglaze with water or stock and scrape the bottom of the pan.",
        "Heat the broth on high heat and add the fish cakes and the rice cakes. Add the toasted black bean paste and sugar. Stir to combine.",
        "Simmer on medium heat for 5 minutes or until the rice cakes become malleable, and the sauce thickens.",
        "Garnish with gochugaru to taste. Serve hot."
      ]
}